In [1]:
import pandas as pd

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
import sys
sys.path.append('../src')

from clean_support import NO2_clean, estacion_timeseries

In [4]:
df22 = pd.read_csv("../data/AytoMad/daily/datos202212.csv", sep=';')
df22 = pd.read_csv("../data/AytoMad/daily/datos202212.csv", sep=';')
df21 = pd.read_csv("../data/AytoMad/daily/datos202112.csv", sep=';')
df20 = pd.read_csv("../data/AytoMad/daily/datos202012.csv", sep=';')
df19 = pd.read_csv("../data/AytoMad/daily/datos201912.csv", sep=';')
df18 = pd.read_csv("../data/AytoMad/daily/datos201812.csv", sep=';')
df16 = pd.read_csv("../data/AytoMad/daily/datos201612.csv", sep=';')

In [5]:
df17 = pd.read_csv("../data/AytoMad/daily/datos17.csv", sep=';')
df15 = pd.read_csv("../data/AytoMad/daily/datos15.csv", sep=';')
df14 = pd.read_csv("../data/AytoMad/daily/datos14.csv", sep=';')
df13 = pd.read_csv("../data/AytoMad/daily/datos13.csv", sep=';')

In [6]:
df_total = pd.concat([df22,df21,df20,df19,df18,df17,df16,df15,df14,df13], ignore_index=True)

In [7]:
df = NO2_clean(df_total)

In [8]:
lst_estaciones = [8, 11, 17, 18, 24, 27, 35, 36, 38, 39, 40, 47, 48, 49, 50, 54, 55, 56, 57, 58, 59, 60]

In [9]:
dataframes_por_estacion = {}

for estacion in lst_estaciones:
    nombre_df = f'df_{estacion}'  # Nombre del DataFrame
    
    df_estacion = df[df["ESTACION"] == estacion].copy()  # Filtrar el DataFrame por cada estación
    
    # Guardar el DataFrame con el nombre específico en el entorno local
    locals()[nombre_df] = df_estacion
    
    # Guardar el DataFrame en el diccionario para referencia adicional si es necesario
    dataframes_por_estacion[nombre_df] = df_estacion
    
    # Imprimir información sobre el DataFrame creado
    print(f"DataFrame {nombre_df} creado. Filas: {len(df_estacion)}, Columnas: {len(df_estacion.columns)}")

DataFrame df_8 creado. Filas: 120, Columnas: 4
DataFrame df_11 creado. Filas: 120, Columnas: 4
DataFrame df_17 creado. Filas: 120, Columnas: 4
DataFrame df_18 creado. Filas: 120, Columnas: 4
DataFrame df_24 creado. Filas: 120, Columnas: 4
DataFrame df_27 creado. Filas: 120, Columnas: 4
DataFrame df_35 creado. Filas: 120, Columnas: 4
DataFrame df_36 creado. Filas: 120, Columnas: 4
DataFrame df_38 creado. Filas: 120, Columnas: 4
DataFrame df_39 creado. Filas: 120, Columnas: 4
DataFrame df_40 creado. Filas: 120, Columnas: 4
DataFrame df_47 creado. Filas: 120, Columnas: 4
DataFrame df_48 creado. Filas: 120, Columnas: 4
DataFrame df_49 creado. Filas: 120, Columnas: 4
DataFrame df_50 creado. Filas: 120, Columnas: 4
DataFrame df_54 creado. Filas: 120, Columnas: 4
DataFrame df_55 creado. Filas: 120, Columnas: 4
DataFrame df_56 creado. Filas: 120, Columnas: 4
DataFrame df_57 creado. Filas: 120, Columnas: 4
DataFrame df_58 creado. Filas: 120, Columnas: 4
DataFrame df_59 creado. Filas: 120, Columnas: 4
DataFrame df_60 creado. Filas: 120, Columnas: 4

In [10]:
df_11

     ESTACION   ANO  MES        NO2
236        11  2013    1  55.548387
237        11  2013    2  43.774194
238        11  2013    3  35.451613
239        11  2013    4  28.935484
240        11  2013    5  31.451613
..        ...   ...  ...        ...
351        11  2022    8  22.258065
352        11  2022    9  25.032258
353        11  2022   10  41.612903
354        11  2022   11  32.096774
355        11  2022   12  38.322581

[120 rows x 4 columns]

In [12]:
estacion_timeseries(df_11)

                  NO2
month
2013-01-01  55.548387
2013-02-01  43.774194
2013-03-01  35.451613
2013-04-01  28.935484
2013-05-01  31.451613
...               ...
2022-08-01  22.258065
2022-09-01  25.032258
2022-10-01  41.612903
2022-11-01  32.096774
2022-12-01  38.322581

[120 rows x 1 columns]

In [13]:
df_11

                  NO2
month
2013-01-01  55.548387
2013-02-01  43.774194
2013-03-01  35.451613
2013-04-01  28.935484
2013-05-01  31.451613
...               ...
2022-08-01  22.258065
2022-09-01  25.032258
2022-10-01  41.612903
2022-11-01  32.096774
2022-12-01  38.322581

[120 rows x 1 columns]